# Baseline
git
sudo
systemd
python3

# Monitoring & diagnostics
htop
iotop
ncdu
net-tools
dnsutils
curl
wget
lsof
strace

# System utilities
unzip
rsync
cron
logrotate
bash-completion
man-db

# Container troubleshooting
jq
netcat-openbsd
iputils-ping
traceroute

# Security
ufw
fail2ban
unattended-upgrades
tcpdump
nmap
bridge-utils
